Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасчетВычетаПоРеализованнымТоварам</xr:Item>
				<xr:Item>AccumulationRegister.НДССИзмененнымСрокомУплаты</xr:Item>
				<xr:Item>InformationRegister.РасчетРаспределенияКосвенныхРасходов</xr:Item>
				<xr:Item>InformationRegister.РасчетПереоценкиВалютныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.РеализацияТМЗ</xr:Item>
				<xr:Item>InformationRegister.ФиксированныеАктивыУчитываемыеОтдельно</xr:Item>
				<xr:Item>AccumulationRegister.НДСВзаиморасчетыСБюджетом</xr:Item>
				<xr:Item>AccumulationRegister.ПереоценкаВнеоборотныхАктивов</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>InformationRegister.СведенияОКорректировкиСтоимостиПродукцииИТоваров</xr:Item>
				<xr:Item>InformationRegister.РасчетСписанияРБП</xr:Item>
				<xr:Item>InformationRegister.РасчетСебестоимостиПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизацияНМАБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизацияОСБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизацияФАНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеПодотчетныхСуммБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеПодотчетныхСуммНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеСчетовНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетАвансовыхПлатежейПоНалогамИСборамБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетАвансовыхПлатежейПоНалогамИСборамНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереносНЗПБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереносНЗПНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаВалютныхСредствБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВременныхРазниц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВычетаПоРеализованнымТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВычетовПоНалогам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВычетовПоПреференциям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВычетовПоРасходамНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетДоходаОтПревышенияСтоимостиВыбывшихФА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИтоговогоДоходаУбыткаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетНДСКЗачету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСтоимостиПродукцииБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСтоимостиПродукцииНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеформацияБалансаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПриВыбытииВсехФАГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеРБПБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеРезерваПоПереоценкеОСБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеСтоимостногоБалансаГруппыМенееМинимума</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИтоговогоДоходаУбыткаНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеформацияБалансаНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетАвансовИПереплатПоНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ошибки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРегламентнойОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КурсыВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакрытиеМесяца/Forms/ФормаОшибок/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Описание формы
// Параметры фомры:
//  Ошибки - Булево - Истина - будут показаны ошибки, Ложь - комментарии.
//  СсылкаЗакрытиеМесяца - ДокументСсылка.ЗакрытиеМесяца - Ссылка на документ
//   ЗакрытиеМесяца для которого необходимо показать ошибки или комментарии.
//  ВидРегламентнойОперации - ПеречислениеСсылка.ВидыРегламентныхОпераций -
//   Вид операции, для которого будут показаны ошибки или комментарии.
//   Если не задан, то ошибки и комментарии будут показаны в целом для документа.
//  
////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//////////////////////////////////////////////////////////////////////////////
	// Заполнить реквизит ЗакрытиеМесяца.
	ЗакрытиеМесяца = Параметры.СсылкаЗакрытиеМесяца;
	
	
	
	//////////////////////////////////////////////////////////////////////////////
	// Заполнить таблицу.	
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Комментарий", НЕ Параметры.Ошибки);
	Если ЗначениеЗаполнено(Параметры.ВидРегламентнойОперации) Тогда
		ПараметрыПоиска.Вставить("ВидРегламентнойОперации", Параметры.ВидРегламентнойОперации);
	КонецЕсли;
	МассивСтрок = Параметры.СсылкаЗакрытиеМесяца.Ошибки.НайтиСтроки(ПараметрыПоиска);	
	
	НомерСтроки = 1;
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		НоваяСтрока = Ошибки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	
	
	//////////////////////////////////////////////////////////////////////////////
	// Установить заголовок формы.
	Если Параметры.Ошибки Тогда
		Заголовок = НСтр("ru = 'Ошибки документа ""Закрытие месяца""'");	
	Иначе
		Заголовок = НСтр("ru = 'Комментарии документа ""Закрытие месяца""'");	
	КонецЕсли;
	
	
	
	//////////////////////////////////////////////////////////////////////////////	
	// Установить заголовок таблицы.
	Если Параметры.Ошибки Тогда
		Элементы.ЗаголовокТаблицы.Заголовок = НСтр("ru = 'Устраните указанные ошибки и повторите выполнение операции:'");
	Иначе
		Элементы.ЗаголовокТаблицы.Заголовок = НСтр("ru = 'Список сопроводительных сообщений:'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеМесяцаНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(,ЗакрытиеМесяца);
КонецПроцедуры
